In [14]:
import pandas as pd
df = pd.read_csv('balance.txt',sep=' ') #get dataframe
df.head()

,Balance,Income,Limit,Rating,Cards,Age,Education,Gender,Student,Married,Ethnicity
0,12.240798,14.891,3606,283,2,34,11,Male,No,Yes,Caucasian
1,23.283334,106.025,6645,483,3,82,15,Female,Yes,Yes,Asian
2,22.530409,104.593,7075,514,4,71,11,Male,No,No,Asian
3,27.652811,148.924,9504,681,3,36,11,Female,No,No,Asian
4,16.893978,55.882,4897,357,2,68,16,Male,No,Yes,Caucasian

In [2]:
df.groupby("Ethnicity")["Income"].mean() #income grouped by ethnicity then taken average of income groups

Ethnicity
African American    47.682101
Asian               44.187833
Caucasian           44.521945
Name: Income, dtype: float64

In [3]:
df.groupby("Married")["Balance"].mean() #balance grouped by married and not married then average taken of balance groups

Married
No     13.493509
Yes    13.388473
Name: Balance, dtype: float64

In [4]:
print("Single people have higher balance.")

Single people have higher balance.

In [13]:
df["Income"].max() #maximum of values from income column

186.634

In [15]:
df["Income"].min() #minimum of values from income column

10.354

In [16]:
df["Cards"].sum() #sum values from cards column

1183

In [8]:
df.groupby("Gender").size() #count the number of rows in each group of group by gender.

Gender
 Male     193
Female    207
dtype: int64